Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC4B.xml
      <value-group name="AST_IDR__ALARM1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__CLKRDY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__OVF">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="AST_IDR__PER0">
        <value name="0" caption="No effet" value="0"/>
        <value name="1" caption="Disalbe interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__PER1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__READY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IMR__ALARM0">
        <value name="0" caption="Interupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__ALARM1">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__CLKRDY">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__OVF">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="AST_IMR__PER0">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__PER1">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__READY">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_WER__ALARM0">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_WER__ALARM1">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_WER__OVF">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_WER__PER0">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_WER__PER1">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_CLOCK__CEN">
        <value name="0" caption="The clock is disabled" value="0"/>
        <value name="1" caption="The clock is enabled" value="1"/>
      </value-group>
      <value-group name="AST_CLOCK__CSSEL">
        <value name="SLOWCLOCK" caption="Slow clock" value="0"/>
        <value name="32KHZCLK" caption="32 kHz clock" value="1"/>
        <value name="PBCLOCK" caption="PB clock" value="2"/>
        <value name="GCLK" caption="Generic clock" value="3"/>
        <value name="1KHZCLK" caption="1kHz clock from 32 kHz oscillator" value="4"/>
      </value-group>
      <value-group name="AST_PARAMETER__DT">
        <value name="OFF" caption="Digital tuner off" value="0"/>
        <value name="ON" caption="Digital tuner on" value="1"/>
      </value-group>
      <value-group name="AST_PARAMETER__DTEXPWA">
        <value name="0" caption="Digital tuner exponent is a constant value. Writes to EXP bitfield in DTR will be discarded." value="0"/>
        <value name="1" caption="Digital tuner exponent is chosen by writing to EXP bitfield in DTR" value="1"/>
      </value-group>
      <value-group name="AST_PARAMETER__NUMAR">
        <value name="ZERO" caption="No alarm comparators" value="0"/>
        <value name="ONE" caption="One alarm comparator" value="1"/>
        <value name="TWO" caption="Two alarm comparators" value="2"/>
      </value-group>
      <value-group name="AST_PARAMETER__NUMPIR">
        <value name="ONE" caption="One periodic comparator" value="0"/>
        <value name="TWO" caption="Two periodic comparators" value="1"/>
      </value-group>
      <value-group name="AST_PARAMETER__PIR0WA">
        <value name="0" caption="Periodic alarm prescaler 0 tapping is a constant value. Writes to INSEL bitfield in PIR0 will be discarded." value="0"/>
        <value name="1" caption="Periodic alarm prescaler 0 tapping is chosen by writing to INSEL bitfield in PIR0" value="1"/>
      </value-group>
      <value-group name="AST_PARAMETER__PIR1WA">
        <value name="0" caption="Writes to PIR1 will be discarded" value="0"/>
        <value name="1" caption="PIR1 can be written" value="1"/>
      </value-group>
    </module>
    <module name="BPM" id="I7197" version="1.2.0" caption="Backup Power Manager">
      <register-group name="BPM" caption="Backup Power Manager">
        <register name="IER" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Enable" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Enable" mask="0x80000000"/>
        </register>
        <register name="IDR" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Disable" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Disable" mask="0x80000000"/>
        </register>
        <register name="IMR" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Mask" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Mask" mask="0x80000000"/>
        </register>
        <register name="ISR" offset="0xc" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Status" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Status" mask="0x80000000"/>
        </register>
        <register name="ICR" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Status Clear" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Status Clear" mask="0x80000000"/>
        </register>
        <register name="SR" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="PSOK" caption="Power Scaling OK Status" mask="0x1"/>
        </register>
        <register name="UNLOCK" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Unlock Register">
          <bitfield name="ADDR" caption="Unlock Address" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlock Key" mask="0xFF000000"/>
        </register>
        <register name="PMCON" offset="0x1c" rw="RW" size="4" initval="0x00000000" caption="Power Mode Control Register">
          <bitfield name="PS" caption="Power Scaling Configuration Value" mask="0x3"/>
          <bitfield name="PSCREQ" caption="Power Scaling Change Request" mask="0x4"/>
          <bitfield name="PSCM" caption="Power Scaling Change Mode" mask="0x8"/>
          <bitfield name="BKUP" caption="BACKUP Mode" mask="0x100"/>
          <bitfield name="RET" caption="RETENTION Mode" mask="0x200"/>
          <bitfield name="SLEEP" caption="SLEEP mode Configuration" mask="0x3000"/>
          <bitfield name="CK32S" caption="32Khz-1Khz Clock Source Selection" mask="0x10000"/>
          <bitfield name="FASTWKUP" caption="Fast Wakeup" mask="0x1000000"/>
        </register>
        <register name="BKUPWCAUSE" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Backup Wake up Cause Register">
        </register>
        <register name="BKUPWEN" offset="0x2c" rw="RW" size="4" initval="0x00000000" caption="Backup Wake up Enable Register">
        </register>
        <register name="BKUPPMUX" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Backup Pin Muxing Register">
          <bitfield name="BKUPPMUX" caption="Backup Pin Muxing" mask="0x1FF"/>
        </register>
        <register name="IORET" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Input Output Retention Register">
          <bitfield name="RET" caption="Retention on I/O lines after waking up from the BACKUP mode" mask="0x1"/>
        </register>
        <register name="BPR" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Bypass Register">
          <bitfield name="RUNPSPB" caption="Run Mode Power Scaling Preset Bypass" mask="0x1"/>
          <bitfield name="PSMPSPB" caption="Power Save Mode Power Scaling Preset Bypass" mask="0x2"/>
          <bitfield name="SEQSTN" caption="Sequencial Startup from ULP (Active Low)" mask="0x4"/>
          <bitfield name="PSBTD" caption="Power Scaling Bias Timing Disable" mask="0x8"/>
          <bitfield name="PSHFD" caption="Power Scaling Halt Flash Until VREGOK Disable" mask="0x10"/>
          <bitfield name="DLYRSTD" caption="Delaying Reset Disable" mask="0x20"/>
          <bitfield name="BIASSEN" caption="Bias Switch Enable" mask="0x40"/>
          <bitfield name="LATSEN" caption="Latdel Switch Enable" mask="0x80"/>
          <bitfield name="BOD18CONT" caption="BOD18 in continuous mode not disabled in WAIT/RET/BACKUP modes" mask="0x100"/>
          <bitfield name="POBS" caption="Pico Uart Observability" mask="0x200"/>
          <bitfield name="FFFW" caption="Force Flash Fast Wakeup" mask="0x400"/>
          <bitfield name="FBRDYEN" caption="Flash Bias Ready Enable" mask="0x800"/>
          <bitfield name="FVREFSEN" caption="Flash Vref Switch Enable" mask="0x1000"/>
        </register>
        <register name="FWRUNPS" offset="0x44" rw="R" size="4" caption="Factory Word Run PS Register">
          <bitfield name="REGLEVEL" caption="Regulator Voltage Level" mask="0xF"/>
          <bitfield name="REGTYPE" caption="Regulator Type" mask="0x30" values="BPM_FWRUNPS__REGTYPE"/>
          <bitfield name="REFTYPE" caption="Reference Type" mask="0xC0" values="BPM_FWRUNPS__REFTYPE"/>
          <bitfield name="FLASHLATDEL" caption="Flash Latch Delay Value" mask="0x1F00"/>
          <bitfield name="FLASHBIAS" caption="Flash Bias Value" mask="0x1E000"/>
          <bitfield name="FPPW" caption="Flash Pico Power Mode" mask="0x20000"/>
          <bitfield name="RC115" caption="RC 115KHZ Calibration Value" mask="0x1FC0000"/>
          <bitfield name="RCFAST" caption="RCFAST Calibration Value" mask="0xFE000000"/>
        </register>
        <register name="FWPSAVEPS" offset="0x48" rw="R" size="4" caption="Factory Word Power Save PS Register">
          <bitfield name="WREGLEVEL" caption="Wait mode Regulator Level" mask="0xF"/>
          <bitfield name="WBIAS" caption="Bias in wait mode" mask="0xF0"/>
          <bitfield name="WLATDEL" caption="Flash Latdel in wait mode" mask="0x1F00"/>
          <bitfield name="RREGLEVEL" caption="Retention mode Regulator Level" mask="0x1E000"/>
          <bitfield name="RBIAS" caption="Bias in Retention mode" mask="0x1E0000"/>
          <bitfield name="RLATDEL" caption="Flash Latdel in Retention mode" mask="0x3E00000"/>
          <bitfield name="BREGLEVEL" caption="Backup mode Regulator Level" mask="0x3C000000"/>
          <bitfield name="POR18DIS" caption="POR 18 Disable" mask="0x40000000"/>
          <bitfield name="FWSAS" caption="Flash Wait State Automatic Switching" mask="0x80000000"/>
        </register>
        <register name="VERSION" offset="0xfc" rw="R" size="4" initval="0x00000120" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="BPM_FWRUNPS__REFTYPE">
        <value name="BOTH" value="0"/>
        <value name="BG" value="1"/>
        <value name="LPBG" value="2"/>
        <value name="INTERNAL" value="3"/>
      </value-group>
      <value-group name="BPM_FWRUNPS__REGTYPE">
        <value name="NORMAL" value="0"/>
        <value name="LP" value="1"/>
        <value name="XULP" value="2"/>
      </value-group>
    </module>
    <module name="BSCIF" version="1.0.0" caption="Backup System Control Interface">
      <register-group name="BSCIF" caption="Backup System Control Interface">
        <register name="IER" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="IDR" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Mai n VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="IMR" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="ISR" offset="0xc" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="ICR" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="PCLKSR" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="RC1MRDY" caption="RC 1MHz Oscillator Ready" mask="0x800"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
        </register>
        <register name="UNLOCK" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Unlock Register">
          <bitfield name="ADDR" caption="Unlock Address" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlock Key" mask="0xFF000000" values="BSCIF_UNLOCK__KEY"/>
        </register>
        <register name="CSCR" offset="0x1c" rw="RW" size="4" initval="0x00000000" caption="Chip Specific Configuration Register">
        </register>
        <register name="OSCCTRL32" offset="0x20" rw="RW" size="4" initval="0x00000004" caption="Oscillator 32 Control Register">
          <bitfield name="OSC32EN" caption="32 KHz Oscillator Enable" mask="0x1"/>
          <bitfield name="PINSEL" caption="Pins Select" mask="0x2"/>
          <bitfield name="EN32K" caption="32 KHz output Enable" mask="0x4"/>
          <bitfield name="EN1K" caption="1 KHz output Enable" mask="0x8"/>
          <bitfield name="MODE" caption="Oscillator Mode" mask="0x700"/>
          <bitfield name="SELCURR" caption="Current selection" mask="0xF000"/>
          <bitfield name="STARTUP" caption="Oscillator Start-up Time" mask="0x70000"/>
        </register>
        <register name="RC32KCR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="32 kHz RC Oscillator Control Register">
          <bitfield name="EN" caption="Enable as Generic clock source" mask="0x1"/>
          <bitfield name="TCEN" caption="Temperature Compensation Enable" mask="0x2"/>
          <bitfield name="EN32K" caption="Enable 32 KHz output" mask="0x4"/>
          <bitfield name="EN1K" caption="Enable 1 kHz output" mask="0x8"/>
          <bitfield name="MODE" caption="Mode Selection" mask="0x10"/>
          <bitfield name="REF" caption="Reference select" mask="0x20"/>
          <bitfield name="FCD" caption="Flash calibration done" mask="0x80"/>
        </register>
        <register name="RC32KTUNE" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="32kHz RC Oscillator Tuning Register">
          <bitfield name="FINE" caption="Fine value" mask="0x3F"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0x7F0000"/>
        </register>
