Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC4B.xml
        <register name="VERSION" offset="0xfc" rw="R" size="4" initval="0x00000402" caption="Version Register">
          <bitfield name="VERSION" caption="Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell." mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Reserved.  Value subject to change.  No functionality associated." mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="TC_CCR__CLKDIS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the clock." value="1"/>
      </value-group>
      <value-group name="TC_CCR__CLKEN">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the clock if CLKDIS is not 1." value="1"/>
      </value-group>
      <value-group name="TC_CCR__SWTRG">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="A software trigger is performed:the counter is reset and clock is started." value="1"/>
      </value-group>
      <value-group name="TC_CMR__ABETRG">
        <value name="0" caption="TIOB is used as an external trigger." value="0"/>
        <value name="1" caption="TIOA is used as an external trigger." value="1"/>
      </value-group>
      <value-group name="TC_CMR__BURST">
        <value name="NOT_GATED" caption="The clock is not gated by an external signal." value="0"/>
        <value name="CLK_AND_XC0" caption="XC0 is ANDed with the selected clock." value="1"/>
        <value name="CLK_AND_XC1" caption="XC1 is ANDed with the selected clock." value="2"/>
        <value name="CLK_AND_XC2" caption="XC2 is ANDed with the selected clock." value="3"/>
      </value-group>
      <value-group name="TC_CMR__CLKI">
        <value name="0" caption="Counter is incremented on rising edge of the clock." value="0"/>
        <value name="1" caption="Counter is incremented on falling edge of the clock." value="1"/>
      </value-group>
      <value-group name="TC_CMR__CPCTRG">
        <value name="0" caption="RC Compare has no effect on the counter and its clock." value="0"/>
        <value name="1" caption="RC Compare resets the counter and starts the counter clock." value="1"/>
      </value-group>
      <value-group name="TC_CMR__ETRGEDG">
        <value name="NO_EDGE" caption="None" value="0"/>
        <value name="POS_EDGE" caption="Rising edge" value="1"/>
        <value name="NEG_EDGE" caption="Falling edge" value="2"/>
        <value name="BOTH_EDGES" caption="Each edge" value="3"/>
      </value-group>
      <value-group name="TC_CMR__LDBDIS">
        <value name="0" caption="Counter clock is not disabled when RB loading occurs." value="0"/>
        <value name="1" caption="Counter clock is disabled when RB loading occurs." value="1"/>
      </value-group>
      <value-group name="TC_CMR__LDBSTOP">
        <value name="0" caption="Counter clock is not stopped when RB loading occurs." value="0"/>
        <value name="1" caption="Counter clock is stopped when RB loading occurs." value="1"/>
      </value-group>
      <value-group name="TC_CMR__LDRA">
        <value name="NO_EDGE" caption="None" value="0"/>
        <value name="POS_EDGE_TIOA" caption="Rising edge of TIOA" value="1"/>
        <value name="NEG_EDGE_TIOA" caption="Falling edge of TIOA" value="2"/>
        <value name="BOTH_EDGES_TIOA" caption="Each edge of TIOA" value="3"/>
      </value-group>
      <value-group name="TC_CMR__LDRB">
        <value name="NO_EDGE" caption="None" value="0"/>
        <value name="POS_EDGE_TIOA" caption="Rising edge of TIOA" value="1"/>
        <value name="NEG_EDGE_TIOA" caption="Falling edge of TIOA" value="2"/>
        <value name="BOTH_EDGES_TIOA" caption="Each edge of TIOA" value="3"/>
      </value-group>
      <value-group name="TC_CMR__TCCLKS">
        <value name="TIMER_CLOCK1" caption="TIMER_CLOCK1" value="0"/>
        <value name="TIMER_CLOCK2" caption="TIMER_CLOCK2" value="1"/>
        <value name="TIMER_CLOCK3" caption="TIMER_CLOCK3" value="2"/>
        <value name="TIMER_CLOCK4" caption="TIMER_CLOCK4" value="3"/>
        <value name="TIMER_CLOCK5" caption="TIMER_CLOCK5" value="4"/>
        <value name="XC0" caption="XC0" value="5"/>
        <value name="XC1" caption="XC1" value="6"/>
        <value name="XC2" caption="XC2" value="7"/>
      </value-group>
      <value-group name="TC_CMR__WAVE">
        <value name="0" caption="Capture Mode is enabled." value="0"/>
        <value name="1" caption="Capture Mode is disabled (Waveform Mode is enabled)." value="1"/>
      </value-group>
      <value-group name="TC_CMR__ACPA">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__ACPC">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__AEEVT">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__ASWTRG">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__BCPB">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__BCPC">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__BEEVT">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
      <value-group name="TC_CMR__BSWTRG">
        <value name="NONE" caption="None" value="0"/>
        <value name="SET" caption="Set" value="1"/>
        <value name="CLEAR" caption="Clear" value="2"/>
        <value name="TOGGLE" caption="Toggle" value="3"/>
      </value-group>
